Revit 2027 API
MassLevelData.IsValidConceptualConstructionTypeElement Method
 Checks if the ElementId is an acceptable conceptual construction type ElementId for the MassLevelData (Mass Floor).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidConceptualConstructionTypeElement(
	ElementId id
)
Public Function IsValidConceptualConstructionTypeElement (
	id As ElementId
) As Boolean
public:
bool IsValidConceptualConstructionTypeElement(
	ElementId^ id
)
member IsValidConceptualConstructionTypeElement :
        id : ElementId -> bool
Parameters
id ElementId
 The ElementId to be checked.
Return Value
Boolean
 True if the ElementId is an acceptable conceptual construction type ElementId, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 In the case that 'conceptualConstructionIsByEnergyData' is true, invalidElementId is also acceptable input.
See Also
Reference
MassLevelData Class
Autodesk.Revit.DB.Analysis Namespace